In [3]:
import mysql.connector

connection = mysql.connector.connect(
    user='root',
    password='your password,
    host='localhost',
    database='database name',
    #ssl_disable=True
)
cursor = connection.cursor()

# Reading from a database

In [44]:
query = '''
    SELECT 
	customer_id,
    first_name,
    points,
	'Bronze' AS type
FROM customers 
WHERE points <= 2000
UNION
SELECT 
	customer_id,
    first_name,
    points,
	'Silver' AS type
FROM customers 
WHERE points BETWEEN 2000 AND 3000
UNION
SELECT 
	customer_id,
    first_name,
    points,
	'GOLD' AS type
FROM customers 
WHERE  points > 3000
ORDER BY first_name
'''
cursor.execute(query)

results = []
for i, data in enumerate(cursor):
    results.append(data)
    
connection.close()
cursor.close()

True

In [45]:
import pandas as pd
df_pulled = pd.DataFrame(results)
df_pulled.columns = ['customer_id', 'first_name', 'points', 'type']

In [46]:
df_pulled

    customer_id first_name  points    type
0             4      Ambur     457  Bronze
1             1     Babara    2273  Silver
2             5    Clemmie    3675    GOLD
3             6       Elka    3073    GOLD
4             3     Freddi    2967  Silver
5             7      Ilene    1672  Bronze
6             2       Ines     947  Bronze
7            11       John       0  Bronze
8            10       Levy     796  Bronze
9             9     Romola    1486  Bronze
10            8    Thacher     205  Bronze

# Writing to a database

In [40]:
top_2_points = df_pulled.groupby(['customer_id', 'first_name', 'type'])['points'].max()

In [41]:
top_2_points

customer_id  first_name  type
1            Babara      Silver    2273
2            Ines        Bronze     947
3            Freddi      Silver    2967
4            Ambur       Bronze     457
5            Clemmie     GOLD      3675
6            Elka        GOLD      3073
7            Ilene       Bronze    1672
8            Thacher     Bronze     205
9            Romola      Bronze    1486
10           Levy        Bronze     796
11           John        Bronze       0
Name: points, dtype: int64

In [42]:
top_2_points.to_sql('top_2_points', engine)

NameError: name 'engine' is not defined